src/openpersonen/templates/response/ResponseBG.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <env:Header>
      <wsa:MessageID>urn:A5542E10BCDA11E8BFD15BA758849566</wsa:MessageID>
      <wsa:ReplyTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:ReplyTo>
      <wsa:FaultTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      </wsa:FaultTo>
   </env:Header>
   <env:Body>
      <npsLa01 xmlns:hlm="http://www.oracle.com/XSL/Transform/java/nl.haarlem.util.xpath.HlmXPathFunctions" xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
         <BG:stuurgegevens>
            <StUF:berichtcode xmlns:StUF="http://www.egem.nl/StUF/StUF0301">La01</StUF:berichtcode>
            <StUF:zender xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
               <StUF:organisatie>0392</StUF:organisatie>
               <StUF:applicatie>ESB</StUF:applicatie>
            </StUF:zender>
            <StUF:ontvanger xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
               <StUF:organisatie>0392</StUF:organisatie>
               <StUF:applicatie>ELOKET_EBASE</StUF:applicatie>
            </StUF:ontvanger>
            <StUF:referentienummer xmlns:StUF="http://www.egem.nl/StUF/StUF0301"/>
            <StUF:tijdstipBericht xmlns:StUF="http://www.egem.nl/StUF/StUF0301">20180920153948993</StUF:tijdstipBericht>
            <StUF:entiteittype xmlns:StUF="http://www.egem.nl/StUF/StUF0301">NPS</StUF:entiteittype>
         </BG:stuurgegevens>
         <BG:parameters>
            <StUF:indicatorVervolgvraag xmlns:StUF="http://www.egem.nl/StUF/StUF0301">false</StUF:indicatorVervolgvraag>
            <StUF:aantalVoorkomens xmlns:StUF="http://www.egem.nl/StUF/StUF0301">1</StUF:aantalVoorkomens>
         </BG:parameters>
         <BG:antwoord>
            <object StUF:entiteittype="NPS" StUF:sleutelVerzendend="170261426" xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
               <BG:inp.bsn>123456780</BG:inp.bsn>
               <BG:geslachtsnaam>Vliet</BG:geslachtsnaam>
               <BG:voorvoegselGeslachtsnaam>van</BG:voorvoegselGeslachtsnaam>
               <BG:voorletters>I.</BG:voorletters>
               <BG:voornamen>Isaak</BG:voornamen>
               <BG:aanduidingNaamgebruik>E</BG:aanduidingNaamgebruik>
               <BG:geslachtsnaamPartner>Vliet</BG:geslachtsnaamPartner>
               <BG:voorvoegselGeslachtsnaamPartner>van</BG:voorvoegselGeslachtsnaamPartner>
               <BG:adellijkeTitelPredikaat StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
               <BG:geboortedatum>19800915</BG:geboortedatum>
               <BG:inp.geboorteplaats>Amsterdam</BG:inp.geboorteplaats>
               <BG:inp.geboorteLand>6030</BG:inp.geboorteLand>
               <BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.overlijdenplaats StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.overlijdenLand StUF:noValue="nietOndersteund" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:verblijfsadres>
                  <BG:wpl.identificatie>Haarlem</BG:wpl.identificatie>
                  <BG:wpl.woonplaatsNaam>Haarlem</BG:wpl.woonplaatsNaam>
                  <BG:gor.openbareRuimteNaam>Grote Markt</BG:gor.openbareRuimteNaam>
                  <BG:gor.straatnaam>Grote Markt</BG:gor.straatnaam>
                  <BG:aoa.postcode>2011RD</BG:aoa.postcode>
                  <BG:aoa.huisnummer>2</BG:aoa.huisnummer>
                  <BG:aoa.huisletter StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:aoa.huisnummertoevoeging StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:begindatumVerblijf>20051216</BG:begindatumVerblijf>
               </BG:verblijfsadres>
               <BG:inp.burgerlijkeStaat>2</BG:inp.burgerlijkeStaat>
               <BG:inp.gemeenteVanInschrijving>0392</BG:inp.gemeenteVanInschrijving>
               <BG:inp.datumInschrijving>20051216</BG:inp.datumInschrijving>
               <BG:inp.datumVestigingInNederland StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.immigratieLand StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.datumVertrekUitNederland StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.emigratieLand StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.indicatieGeheim>0</BG:inp.indicatieGeheim>
               <StUF:tijdstipRegistratie StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               <BG:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW">
                  <BG:gerelateerde StUF:entiteittype="NPS" StUF:sleutelVerzendend="130338588">
                     <BG:inp.bsn>123456789</BG:inp.bsn>
                     <BG:inp.a-nummer>9727574572</BG:inp.a-nummer>
                     <BG:geslachtsnaam>Leeuw</BG:geslachtsnaam>
                     <BG:voorvoegselGeslachtsnaam>de</BG:voorvoegselGeslachtsnaam>
                     <BG:voorletters>Z.</BG:voorletters>
                     <BG:voornamen>Zaina</BG:voornamen>
                     <BG:aanduidingNaamgebruik>E</BG:aanduidingNaamgebruik>
                     <BG:adellijkeTitelPredikaat StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:geslachtsaanduiding StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:geboortedatum>19730922</BG:geboortedatum>
                     <BG:inp.geboorteplaats StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:inp.geboorteLand StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:overlijdensdatum StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  </BG:gerelateerde>
                  <BG:soortVerbintenis/>
                  <BG:plaatsSluiting StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:landSluiting StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:datumOntbinding StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:plaatsOntbinding StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:landOntbinding StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:redenOntbinding StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  <BG:brondocument StUF:metagegeven="true">
                     <BG:identificatie StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:datum StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:omschrijving StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:gemeente StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:aktegemeente StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                  </BG:brondocument>
                  <BG:historieMaterieel>
                     <BG:soortVerbintenis StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:datumSluiting>20040427</BG:datumSluiting>
                     <BG:plaatsSluiting StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <BG:landSluiting StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
                     <StUF:tijdvakGeldigheid>
                        <StUF:beginGeldigheid/>
                        <StUF:eindGeldigheid/>
                     </StUF:tijdvakGeldigheid>
                  </BG:historieMaterieel>
               </BG:inp.heeftAlsEchtgenootPartner>
               <BG:inp.heeftAlsKinderen StUF:entiteittype="NPSNPSKND">
                  <BG:gerelateerde StUF:entiteittype="NPS" StUF:sleutelVerzendend="430044367">
                     <BG:inp.bsn>123456781</BG:inp.bsn>
                  </BG:gerelateerde>
               </BG:inp.heeftAlsKinderen>
               <BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
                  <BG:gerelateerde StUF:entiteittype="NPS" StUF:sleutelVerzendend="070413228">
                     <BG:inp.bsn>123456790</BG:inp.bsn>
                  </BG:gerelateerde>
                  <BG:ouderAanduiding>Ouder1</BG:ouderAanduiding>
               </BG:inp.heeftAlsOuders>
               <BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD">
                  <BG:gerelateerde StUF:entiteittype="NPS" StUF:sleutelVerzendend="074264412">
                     <BG:inp.bsn>123456791</BG:inp.bsn>
                  </BG:gerelateerde>
                  <BG:ouderAanduiding>Ouder2</BG:ouderAanduiding>
               </BG:inp.heeftAlsOuders>
               <BG:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT">
                  <BG:gerelateerde StUF:entiteittype="NAT">
                     <BG:code>0001</BG:code>
                     <BG:omschrijving>Nederlandse</BG:omschrijving>
                  </BG:gerelateerde>
                  <StUF:tijdstipRegistratie StUF:noValue="geenWaarde" xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
               </BG:inp.heeftAlsNationaliteit>
            </object>
         </BG:antwoord>
      </npsLa01>
   </env:Body>
</env:Envelope>
